In [1]:
import pandas as pd
df = pd.DataFrame({
    'class' : ['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B'],
    'number' : [1,2,3,4,5,1,2,3,4,5],
    'math' : [90, 20, 50, 30, 57, 67, 89, 79, 45, 23],
    'english' : [40, 21, 68, 89, 90, 87, 89, 54, 21, 23]
})
df

  class  english  math  number
0     A       40    90       1
1     A       21    20       2
2     A       68    50       3
3     A       89    30       4
4     A       90    57       5
5     B       87    67       1
6     B       89    89       2
7     B       54    79       3
8     B       21    45       4
9     B       23    23       5

In [3]:
list(df.index)

RangeIndex(start=0, stop=10, step=1)

In [4]:
list(df.columns)

['class', 'english', 'math', 'number']

In [6]:
df1 = df.set_index(['number', 'class'])
df1

              english  math
number class
1      A           40    90
2      A           21    20
3      A           68    50
4      A           89    30
5      A           90    57
1      B           87    67
2      B           89    89
3      B           54    79
4      B           21    45
5      B           23    23

In [8]:
list(df1.index)

[(1, 'A'),
 (2, 'A'),
 (3, 'A'),
 (4, 'A'),
 (5, 'A'),
 (1, 'B'),
 (2, 'B'),
 (3, 'B'),
 (4, 'B'),
 (5, 'B')]

In [9]:
list(df1.columns)

['english', 'math']

In [7]:
df2 = df1.unstack()
df2

       english     math
class        A   B    A   B
number
1           40  87   90  67
2           21  89   20  89
3           68  54   50  79
4           89  21   30  45
5           90  23   57  23

In [10]:
list(df2.index)

[1, 2, 3, 4, 5]

In [11]:
list(df2.columns)

[('english', 'A'), ('english', 'B'), ('math', 'A'), ('math', 'B')]

In [14]:
df3 = df2.swaplevel(0, 1, 1)
df3

class        A       B    A    B
       english english math math
number
1           40      87   90   67
2           21      89   20   89
3           68      54   50   79
4           89      21   30   45
5           90      23   57   23

In [15]:
list(df3.columns)

[('A', 'english'), ('B', 'english'), ('A', 'math'), ('B', 'math')]

In [24]:
df3.sort_index(1)

class        A            B
       english math english math
number
1           40   90      87   67
2           21   20      89   89
3           68   50      54   79
4           89   30      21   45
5           90   57      23   23